In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
arr = np.arange(12.).reshape(3, 4)

In [4]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [5]:
arr[0]

array([0., 1., 2., 3.])

In [6]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [11]:
frame = pd.DataFrame(arr, columns=['a', 'b', 'c', 'd'], index=['Utah', 'Ohio', 'Texas'])

In [12]:
frame

         a    b     c     d
Utah   0.0  1.0   2.0   3.0
Ohio   4.0  5.0   6.0   7.0
Texas  8.0  9.0  10.0  11.0

In [13]:
se = frame['d']

In [14]:
se

Utah      3.0
Ohio      7.0
Texas    11.0
Name: d, dtype: float64

In [15]:
frame - se

       Ohio  Texas  Utah   a   b   c   d
Utah    NaN    NaN   NaN NaN NaN NaN NaN
Ohio    NaN    NaN   NaN NaN NaN NaN NaN
Texas   NaN    NaN   NaN NaN NaN NaN NaN

In [17]:
pd.DataFrame.sub(frame, se, axis=0)

         a    b    c    d
Utah  -3.0 -2.0 -1.0  0.0
Ohio  -3.0 -2.0 -1.0  0.0
Texas -3.0 -2.0 -1.0  0.0

In [18]:
frame

         a    b     c     d
Utah   0.0  1.0   2.0   3.0
Ohio   4.0  5.0   6.0   7.0
Texas  8.0  9.0  10.0  11.0

In [19]:
f = lambda x: x.max() - x.min()

In [20]:
frame.apply(f)

a    8.0
b    8.0
c    8.0
d    8.0
dtype: float64

In [21]:
frame.apply(f, axis=1)

Utah     3.0
Ohio     3.0
Texas    3.0
dtype: float64

In [22]:
frame.sum()

a    12.0
b    15.0
c    18.0
d    21.0
dtype: float64

In [23]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [24]:
frame.apply(f)

       a    b     c     d
min  0.0  1.0   2.0   3.0
max  8.0  9.0  10.0  11.0

In [25]:
frame

         a    b     c     d
Utah   0.0  1.0   2.0   3.0
Ohio   4.0  5.0   6.0   7.0
Texas  8.0  9.0  10.0  11.0

In [26]:
frame.sort_index(axis=1)

         a    b     c     d
Utah   0.0  1.0   2.0   3.0
Ohio   4.0  5.0   6.0   7.0
Texas  8.0  9.0  10.0  11.0

In [27]:
frame

         a    b     c     d
Utah   0.0  1.0   2.0   3.0
Ohio   4.0  5.0   6.0   7.0
Texas  8.0  9.0  10.0  11.0

In [28]:
frame.sort_index(axis=0)

         a    b     c     d
Ohio   4.0  5.0   6.0   7.0
Texas  8.0  9.0  10.0  11.0
Utah   0.0  1.0   2.0   3.0

In [29]:
frame

         a    b     c     d
Utah   0.0  1.0   2.0   3.0
Ohio   4.0  5.0   6.0   7.0
Texas  8.0  9.0  10.0  11.0

In [30]:
frame.sort_values?

In [32]:
frame.sort_values(by=['a', 'b'])

         a    b     c     d
Utah   0.0  1.0   2.0   3.0
Ohio   4.0  5.0   6.0   7.0
Texas  8.0  9.0  10.0  11.0

In [33]:
frame.sort_values(by=['c', 'b'])

         a    b     c     d
Utah   0.0  1.0   2.0   3.0
Ohio   4.0  5.0   6.0   7.0
Texas  8.0  9.0  10.0  11.0

In [34]:
frame

         a    b     c     d
Utah   0.0  1.0   2.0   3.0
Ohio   4.0  5.0   6.0   7.0
Texas  8.0  9.0  10.0  11.0

In [35]:
obj = frame.loc['Utah', :]

In [36]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
Name: Utah, dtype: float64

In [37]:
obj.rank?